{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\sunch\Dropbox\github_repos\bdm_bic\analysis/log/clean_qualtrics_data.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Nov 2022, 12:58:57
{txt}
{com}. 
. graph drop _all
{txt}
{com}. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. set graphics off
{txt}
{com}. set scheme s1color
{txt}
{com}. set seed 1984
{txt}
{com}. 
. local date1 = c(current_date)
{txt}
{com}. local time1 = c(current_time)
{txt}
{com}. 
. // import data that has been preliminarily cleaned in csv
. import delimited using $datadir/raw/bdm_10_26_2022_for_import.csv, clear varnames(1)
{res}{text}(406 vars, 102 obs)

{com}. 
. // drop observations missing prolific ID, are incomplete, or from survey preview
. drop if prolific_pid == ""
{txt}(1 observation deleted)

{com}. drop if status == "Survey Preview"
{txt}(0 observations deleted)

{com}. 
. 
. // subject ID
. gen id = _n
{txt}
{com}. label var id "Subject ID"
{txt}
{com}. 
. 
. //merge on prolific demographics
. foreach date in 10_24_2022 10_26_2022 {c -(}
{txt}  2{com}.   merge 1:1 prolific_pid using $datadir/clean/prolific_demo_`date', ///
>   nogen update
{txt}  3{com}. {c )-}
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              61
{txt}{col 9}from master{col 30}{res}              61{txt}  
{col 9}from using{col 30}{res}               0{txt}  

{col 5}matched{col 30}{res}              40
{txt}{col 9}not updated{col 30}{res}              40{txt}  
{col 9}missing updated{col 30}{res}               0{txt}  
{col 9}nonmissing conflict{col 30}{res}               0{txt}  
{col 5}{hline 41}
{res}{txt}{p 0 7 2}
(note: variable
languages_p was 
str16, now str33 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
sex_p was 
str6, now str17 to accommodate using data's values)
{p_end}
{p 0 7 2}
(note: variable
ethnicity_p was 
str5, now str12 to accommodate using data's values)
{p_end}
(label sex_f already defined)

{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}              44
{txt}{col 9}from master{col 30}{res}              43{txt}  
{col 9}from using{col 30}{res}               1{txt}  

{col 5}matched{col 30}{res}              58
{txt}{col 9}not updated{col 30}{res}               0{txt}  
{col 9}missing updated{col 30}{res}              58{txt}  
{col 9}nonmissing conflict{col 30}{res}               0{txt}  
{col 5}{hline 41}

{com}. 
. drop if response_type != "complete"
{txt}(3 observations deleted)

{com}. 
. // delete prolific ID
. drop prolific_pid
{txt}
{com}. 
. // drop variables that have no observations
. drop recipientlastname recipientfirstname recipientemail externalreference ///
>   sce_10* sce_11* *rand_num* *guess_3 *q_3_bonus *q_3_pay_method
{txt}
{com}. 
. 
. //recode the start and end date into Stata date time numeric format
. gen recordeddate_temp = date(startdate, "MDYhm")
{txt}
{com}. format recordeddate_temp %tdnn/dd/CCYY
{txt}
{com}. drop recordeddate
{txt}
{com}. rename recordeddate_temp recordeddate
{res}{txt}
{com}. label var recordeddate "Survey recorded date"
{txt}
{com}. 
. rename durationinseconds duration_sec
{res}{txt}
{com}. 
. 
. // incentive reading time
. rename q25_pagesubmit incentive_time
{res}{txt}
{com}. label var incentive_time "Read time for incentives"
{txt}
{com}. 
. // timing for reporting guesses, in seconds
. rename q43_pagesubmit belief1_time_sce1
{res}{txt}
{com}. rename q49_pagesubmit belief2_time_sce1
{res}{txt}
{com}. 
. rename q55_pagesubmit belief1_time_sce2
{res}{txt}
{com}. rename q61_pagesubmit belief2_time_sce2
{res}{txt}
{com}. 
. rename q67_pagesubmit belief1_time_sce3
{res}{txt}
{com}. rename q73_pagesubmit belief2_time_sce3
{res}{txt}
{com}. 
. rename q79_pagesubmit belief1_time_sce4
{res}{txt}
{com}. rename q85_pagesubmit belief2_time_sce4
{res}{txt}
{com}. 
. rename q93_pagesubmit belief1_time_sce5
{res}{txt}
{com}. rename q99_pagesubmit belief2_time_sce5
{res}{txt}
{com}. 
. rename q105_pagesubmit belief1_time_sce6
{res}{txt}
{com}. rename q111_pagesubmit belief2_time_sce6
{res}{txt}
{com}. 
. rename q117_pagesubmit belief1_time_sce7
{res}{txt}
{com}. rename q123_pagesubmit belief2_time_sce7
{res}{txt}
{com}. 
. rename q129_pagesubmit belief1_time_sce8
{res}{txt}
{com}. rename q135_pagesubmit belief2_time_sce8
{res}{txt}
{com}. 
. rename q144_pagesubmit belief1_time_sce9
{res}{txt}
{com}. rename q150_pagesubmit belief2_time_sce9
{res}{txt}
{com}. 
. rename q163 guess_process
{res}{txt}
{com}. rename q164 feedback
{res}{txt}
{com}. rename q165 age
{res}{txt}
{com}. rename q166 education
{res}{txt}
{com}. rename q167 gender
{res}{txt}
{com}. replace gender = q167_4_text if gender == "Other (please specify)"
{txt}(1 real change made)

{com}. rename q168 race
{res}{txt}
{com}. replace race = q168_6_text if race == "Other"
{txt}(3 real changes made)

{com}. rename q169 coursework
{res}{txt}
{com}. rename q170 instruction_confusion
{res}{txt}
{com}. 
. 
. 
. 
. // rename variables for reshape
. forvalues i = 1/9 {c -(}
{txt}  2{com}.   // prior
.   rename sce_`i'_guess_1 belief1_sce`i'
{txt}  3{com}.   // update
.   rename sce_`i'_guess_2 belief2_sce`i'
{txt}  4{com}. 
.   // number of red urns
.   rename sce_`i'_n_red_urn n_red_urn_sce`i'
{txt}  5{com}.   // number of red balls in red urn
.   rename sce_`i'_n_red_ball_red_urn n_red_ball_rurn_sce`i'
{txt}  6{com}.   // color of selected urn
.   rename sce_`i'_urn_color urn_sce`i'
{txt}  7{com}.   // color of the first ball ball
.   rename sce_`i'_ball_1_color ball1_sce`i'
{txt}  8{com}. 
. {c )-}
{res}{txt}
{com}. 
. 
. // dummies for answering the incentive understanding questions at the end of survey correctly
. gen bdm_check_1_pass = .
{txt}(99 missing values generated)

{com}. replace bdm_check_1_pass = 1 if q157 == "Number Lottery"
{txt}(39 real changes made)

{com}. replace bdm_check_1_pass = 0 if q157 != "Number Lottery" & q157 != ""
{txt}(6 real changes made)

{com}. 
. gen bdm_check_2_pass = .
{txt}(99 missing values generated)

{com}. replace bdm_check_2_pass = 1 if q158 == "I win the bonus with 20% chance"
{txt}(25 real changes made)

{com}. replace bdm_check_2_pass = 0 if q158 != "I win the bonus with 20% chance" & q158 != ""
{txt}(20 real changes made)

{com}. 
. gen bdm_check_3_pass = .
{txt}(99 missing values generated)

{com}. replace bdm_check_3_pass = 1 if q160 == "Event Lottery"
{txt}(37 real changes made)

{com}. replace bdm_check_3_pass = 0 if q160 != "Event Lottery" & q160 != ""
{txt}(8 real changes made)

{com}. 
. gen bdm_check_4_pass = .
{txt}(99 missing values generated)

{com}. replace bdm_check_4_pass = 1 if q161 == "I win the bonus if the selected urn is red"
{txt}(31 real changes made)

{com}. replace bdm_check_4_pass = 0 if q161 != "I win the bonus if the selected urn is red" & q161 != ""
{txt}(14 real changes made)

{com}. 
. // number of correct answers for the incentive understanding checks
. gen n_bdm_check_pass = bdm_check_1_pass ///
>   + bdm_check_2_pass ///
>   + bdm_check_3_pass ///
>   + bdm_check_4_pass
{txt}(54 missing values generated)

{com}. 
. // answered all incentive understanding check questions at the end of survey correctly
. gen bdm_check_pass_all = .
{txt}(99 missing values generated)

{com}. replace bdm_check_pass_all = 1 if n_bdm_check_pass == 4
{txt}(23 real changes made)

{com}. replace bdm_check_pass_all = 0 if n_bdm_check_pass < 4 & n_bdm_check_pass != .
{txt}(22 real changes made)

{com}. 
. 
. 
. gen confused = .
{txt}(99 missing values generated)

{com}. replace confused = 0 if treatment=="no_info"
{txt}(49 real changes made)

{com}. replace confused = 1 if bdm_check_pass_all==1
{txt}(23 real changes made)

{com}. replace confused = 2 if bdm_check_pass_all==0
{txt}(22 real changes made)

{com}. 
. label define confused 0 "No Info" 1 "Understanding" 2 "Confused"
{txt}
{com}. label values confused confused
{txt}
{com}. label var confused "Categorical variable for confusion status"
{txt}
{com}. 
. 
. rename q157 bdm_check_1
{res}{txt}
{com}. rename q158 bdm_check_2
{res}{txt}
{com}. rename q160 bdm_check_3
{res}{txt}
{com}. rename q161 bdm_check_4
{res}{txt}
{com}. 
. 
. 
. // dummmy for full info treatment
. gen full_info = 0
{txt}
{com}. replace full_info = 1 if treatment == "full_info"
{txt}(50 real changes made)

{com}. 
. forvalues i = 1/9 {c -(}
{txt}  2{com}.   // objective prior in percentage points
.   gen prior_sce`i' = n_red_urn_sce`i' * 10
{txt}  3{com}. 
.   // distance to true prior
.   gen belief1_dist_sce`i' = belief1_sce`i' - prior_sce`i'
{txt}  4{com}.   label var belief1_dist_sce`i' "Distance to objective prior in scenario `i'"
{txt}  5{com}. 
.   // misreporting in scenario i first question guess
.   gen belief1_false_sce`i' = 0
{txt}  6{com}.   replace belief1_false_sce`i' = 1 if belief1_sce`i' != prior_sce`i'
{txt}  7{com}. 
. 
.   // tolerance band 5, inclusive
.   gen belief1_false_band_5_sce`i' = 0
{txt}  8{com}.   replace belief1_false_band_5_sce`i' = 1 if abs(belief1_sce`i' - prior_sce`i') > 5
{txt}  9{com}. 
.   // direction of misreporting
.   gen belief1_up_sce`i' = 0
{txt} 10{com}.   replace belief1_up_sce`i' = 1 if belief1_sce`i' > prior_sce`i'
{txt} 11{com}. 
.   gen belief1_down_sce`i' = 0
{txt} 12{com}.   replace belief1_down_sce`i' = 1 if belief1_sce`i' < prior_sce`i'
{txt} 13{com}. 
. 
. 
.   // bayesian posterior
.   gen belief2_bayes_sce`i' =.
{txt} 14{com}. 
.   #delimit ;
{txt}delimiter now ;
{com}.   // if ball is red ;
>   replace belief2_bayes_sce`i' = ((n_red_ball_rurn_sce`i'/10)*(belief1_sce`i'/100)) /
>    ( (n_red_ball_rurn_sce`i'/10)*(belief1_sce`i'/100)
>   + ((10-n_red_ball_rurn_sce`i')/10)*((100-belief1_sce`i')/100) )
>   if ball1_sce`i'=="red"
>   ;
{txt} 15{com}.   // if ball is blue ;
>   replace belief2_bayes_sce`i' = ( ((10-n_red_ball_rurn_sce`i')/10)*(belief1_sce`i'/100) )/
>   ( ((10-n_red_ball_rurn_sce`i')/10)*(belief1_sce`i'/100)
>     + (n_red_ball_rurn_sce`i'/10)*((100-belief1_sce`i')/100) )
>   if ball1_sce`i'=="blue"
>   ;
{txt} 16{com}.   #delimit cr
{txt}delimiter now cr
{com}. 
.   // convert back to percentage points
.   replace belief2_bayes_sce`i' = belief2_bayes_sce`i' * 100
{txt} 17{com}. 
. 
.     // false report for update
.     gen belief2_false_sce`i' = 0
{txt} 18{com}.     replace belief2_false_sce`i' = 1 if belief2_sce`i' != belief2_bayes_sce`i'
{txt} 19{com}. 
.     // false update, tolerance band 5, inclusive
.     gen belief2_false_band_5_sce`i' = 0
{txt} 20{com}.     replace belief2_false_band_5_sce`i' = 1 if abs(belief2_sce`i' - belief2_bayes_sce`i') > 5
{txt} 21{com}. 
.     // distance between update and bayesian posterior
.     gen belief2_dist_sce`i' = belief2_sce`i' - belief2_bayes_sce`i'
{txt} 22{com}. 
.     // bayesian revision
.     gen bayes_revision_sce`i' = belief2_bayes_sce`i' - belief1_sce`i'
{txt} 23{com}. 
.     // actual belief revision
.     gen actual_revision_sce`i' = belief2_sce`i' - belief1_sce`i'
{txt} 24{com}. 
.     // direction of misreporting for updates
.     gen belief2_up_sce`i' = 0
{txt} 25{com}.     replace belief2_up_sce`i' = 1 if belief2_sce`i' > belief2_bayes_sce`i'
{txt} 26{com}. 
.     gen belief2_down_sce`i' = 0
{txt} 27{com}.     replace belief2_down_sce`i' = 1 if belief2_sce`i' < belief2_bayes_sce`i'
{txt} 28{com}. {c )-}
{txt}(22 real changes made)
(16 real changes made)
(18 real changes made)
(4 real changes made)
(99 missing values generated)
(43 real changes made)
(56 real changes made)
(99 real changes made)
(83 real changes made)
(54 real changes made)
(29 real changes made)
(54 real changes made)
(37 real changes made)
(22 real changes made)
(14 real changes made)
(23 real changes made)
(99 missing values generated)
(60 real changes made)
(39 real changes made)
(99 real changes made)
(96 real changes made)
(55 real changes made)
(23 real changes made)
(73 real changes made)
(32 real changes made)
(18 real changes made)
(18 real changes made)
(14 real changes made)
(99 missing values generated)
(74 real changes made)
(25 real changes made)
(99 real changes made)
(98 real changes made)
(73 real changes made)
(21 real changes made)
(77 real changes made)
(30 real changes made)
(17 real changes made)
(19 real changes made)
(11 real changes made)
(99 missing values generated)
(49 real changes made)
(50 real changes made)
(99 real changes made)
(99 real changes made)
(81 real changes made)
(38 real changes made)
(61 real changes made)
(37 real changes made)
(19 real changes made)
(16 real changes made)
(21 real changes made)
(99 missing values generated)
(59 real changes made)
(40 real changes made)
(99 real changes made)
(98 real changes made)
(72 real changes made)
(27 real changes made)
(71 real changes made)
(28 real changes made)
(14 real changes made)
(14 real changes made)
(14 real changes made)
(99 missing values generated)
(49 real changes made)
(50 real changes made)
(99 real changes made)
(83 real changes made)
(62 real changes made)
(43 real changes made)
(40 real changes made)
(32 real changes made)
(15 real changes made)
(15 real changes made)
(17 real changes made)
(99 missing values generated)
(46 real changes made)
(53 real changes made)
(98 real changes made)
(99 real changes made)
(63 real changes made)
(59 real changes made)
(40 real changes made)
(31 real changes made)
(17 real changes made)
(22 real changes made)
(9 real changes made)
(99 missing values generated)
(42 real changes made)
(57 real changes made)
(99 real changes made)
(95 real changes made)
(71 real changes made)
(44 real changes made)
(51 real changes made)
(27 real changes made)
(8 real changes made)
(14 real changes made)
(13 real changes made)
(99 missing values generated)
(20 real changes made)
(79 real changes made)
(98 real changes made)
(98 real changes made)
(53 real changes made)
(72 real changes made)
(26 real changes made)

{com}. 
. 
. // total number of misreports
. gen n_false_total = 0
{txt}
{com}. // misreports in scenarios where prior is less than 50%
. gen n_false_lower50 = 0
{txt}
{com}. // misreports in scenarios where prior is greater than 50%
. gen n_false_higher50 = 0
{txt}
{com}. // misreports in scenarios where prior is equal to 50%
. gen n_false_50 = 0
{txt}
{com}. 
. gen n_false_up = 0
{txt}
{com}. gen n_false_down = 0
{txt}
{com}. 
. // fully bayesian if all updates are bayesian
. gen full_bayes = 1
{txt}
{com}. 
. 
. forvalues i = 1/9 {c -(}
{txt}  2{com}.   replace n_false_total = n_false_total + belief1_false_sce`i'
{txt}  3{com}.   replace n_false_lower50 = n_false_lower50 + belief1_false_sce`i' if prior_sce`i' < 50
{txt}  4{com}.   replace n_false_higher50 = n_false_higher50 + belief1_false_sce`i' if prior_sce`i' > 50
{txt}  5{com}.   replace n_false_50 = n_false_50 + belief1_false_sce`i' if prior_sce`i' == 50
{txt}  6{com}. 
.   gen belief2_true_sce`i' = 1 - belief2_false_sce`i'
{txt}  7{com}.   replace full_bayes = full_bayes * belief2_true_sce`i'
{txt}  8{com}. 
.   gen update_dir_correct_sce`i' = 0
{txt}  9{com}.   replace update_dir_correct_sce`i' = 1 if actual_revision_sce`i' * bayes_revision_sce`i' > 0
{txt} 10{com}. 
. 
. {c )-}
{txt}(22 real changes made)
(0 real changes made)
(0 real changes made)
(22 real changes made)
(83 real changes made)
(75 real changes made)
(37 real changes made)
(0 real changes made)
(37 real changes made)
(0 real changes made)
(15 real changes made)
(68 real changes made)
(32 real changes made)
(0 real changes made)
(32 real changes made)
(0 real changes made)
(0 real changes made)
(76 real changes made)
(30 real changes made)
(0 real changes made)
(30 real changes made)
(0 real changes made)
(1 real change made)
(78 real changes made)
(37 real changes made)
(0 real changes made)
(37 real changes made)
(0 real changes made)
(0 real changes made)
(72 real changes made)
(28 real changes made)
(28 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(70 real changes made)
(32 real changes made)
(32 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(64 real changes made)
(31 real changes made)
(31 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(70 real changes made)
(27 real changes made)
(27 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(62 real changes made)

{com}. 
. 
. gen gender_w = 0
{txt}
{com}. replace gender_w = 1 if gender == "Woman"
{txt}(55 real changes made)

{com}. label var gender_w "Gender: Woman"
{txt}
{com}. 
. gen gender_m = 0
{txt}
{com}. replace gender_m = 1 if gender == "Man"
{txt}(41 real changes made)

{com}. label var gender_m "Gender: Man"
{txt}
{com}. 
. gen gender_nb = 0
{txt}
{com}. replace gender_nb = 0 if gender == "Non-binary"
{txt}(0 real changes made)

{com}. label var gender_nb "Gender: Non-binary"
{txt}
{com}. 
. gen gender_question = 0
{txt}
{com}. replace gender_question = 1 if gender == "Questioning"
{txt}(1 real change made)

{com}. label var gender_question "Gender: Questioning"
{txt}
{com}. 
. gen bachelor_above = 0
{txt}
{com}. replace bachelor_above = 1 if education == "Bachelor's degree" ///
>   | education == "Master's degree" ///
>   | education == "Professional degree"
{txt}(45 real changes made)

{com}. 
. label var bachelor_above "Bachelor's degree or above"
{txt}
{com}. 
. gen probability_course = 1
{txt}
{com}. replace probability_course = 0 if coursework == "None of the above"
{txt}(58 real changes made)

{com}. label var probability_course "Taken probability/statistics course"
{txt}
{com}. 
. 
. 
. save $datadir/clean/bdm_full_sample_wide.dta, replace
{txt}file C:\Users\sunch\Dropbox\Davis\Research_Projects\bdm_incentives\data/clean/bdm_full_sample_wide.dta saved

{com}. 
. 
. 
. 
. //----------------------------------------------------------------
. // reshape into long dataset
. //----------------------------------------------------------------
. 
. 
. 
. keep duration_sec belief* incentive_time ///
>   guess_process feedback age education gender gender* race ///
>   bachelor_above probability_course coursework instruction_confusion ///
>   totalapprovals_p total_bonus total_payment ///
>   n_red* urn* ball* treatment request_info id recordeddate ///
>   bdm_check* n_bdm* full_info prior* n_false* ///
>   bayes_revision_sce* actual_revision_sce* full_bayes belief2_true_sce* ///
>   update_dir_correct_sce* confused
{txt}
{com}. 
. order id treatment prior* belief?_sce? belief*false_sce* n_false*
{txt}
{com}. 
. // reshape into long format
. reshape long prior_sce belief1_sce belief2_sce belief1_false_sce ///
>   belief1_time_sce belief2_time_sce ///
>   belief2_false_sce belief2_false_band_5_sce ///
>   belief2_dist_sce   belief2_bayes_sce belief2_true_sce ///
>   belief2_up_sce belief2_down_sce ///
>   bayes_revision_sce actual_revision_sce ///
>   update_dir_correct_sce ///
>   n_red_urn_sce n_red_ball_rurn_sce urn_sce ball1_sce ///
>   belief1_dist_sce belief1_false_band_5_sce ///
>   belief1_up_sce belief1_down_sce, i(id) j(scenario)
{txt}(note: j = 1 2 3 4 5 6 7 8 9)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}      99   {txt}->{res}     891
{txt}Number of variables            {res}     258   {txt}->{res}      67
{txt}j variable (9 values)                     ->   {res}scenario
{txt}xij variables:
   {res}prior_sce1 prior_sce2 ... prior_sce9   {txt}->   {res}prior_sce
belief1_sce1 belief1_sce2 ... belief1_sce9{txt}->   {res}belief1_sce
belief2_sce1 belief2_sce2 ... belief2_sce9{txt}->   {res}belief2_sce
belief1_false_sce1 belief1_false_sce2 ... belief1_false_sce9{txt}->{res}belief1_false_sce
belief1_time_sce1 belief1_time_sce2 ... belief1_time_sce9{txt}->{res}belief1_time_sce
belief2_time_sce1 belief2_time_sce2 ... belief2_time_sce9{txt}->{res}belief2_time_sce
belief2_false_sce1 belief2_false_sce2 ... belief2_false_sce9{txt}->{res}belief2_false_sce
belief2_false_band_5_sce1 belief2_false_band_5_sce2 ... belief2_false_band_5_sce9{txt}->{res}belief2_false_band_5_sce
belief2_dist_sce1 belief2_dist_sce2 ... belief2_dist_sce9{txt}->{res}belief2_dist_sce
belief2_bayes_sce1 belief2_bayes_sce2 ... belief2_bayes_sce9{txt}->{res}belief2_bayes_sce
belief2_true_sce1 belief2_true_sce2 ... belief2_true_sce9{txt}->{res}belief2_true_sce
belief2_up_sce1 belief2_up_sce2 ... belief2_up_sce9{txt}->{res}belief2_up_sce
belief2_down_sce1 belief2_down_sce2 ... belief2_down_sce9{txt}->{res}belief2_down_sce
bayes_revision_sce1 bayes_revision_sce2 ... bayes_revision_sce9{txt}->{res}bayes_revision_sce
actual_revision_sce1 actual_revision_sce2 ... actual_revision_sce9{txt}->{res}actual_revision_sce
update_dir_correct_sce1 update_dir_correct_sce2 ... update_dir_correct_sce9{txt}->{res}update_dir_correct_sce
n_red_urn_sce1 n_red_urn_sce2 ... n_red_urn_sce9{txt}->{res}n_red_urn_sce
n_red_ball_rurn_sce1 n_red_ball_rurn_sce2 ... n_red_ball_rurn_sce9{txt}->{res}n_red_ball_rurn_sce
         urn_sce1 urn_sce2 ... urn_sce9   {txt}->   {res}urn_sce
   ball1_sce1 ball1_sce2 ... ball1_sce9   {txt}->   {res}ball1_sce
belief1_dist_sce1 belief1_dist_sce2 ... belief1_dist_sce9{txt}->{res}belief1_dist_sce
belief1_false_band_5_sce1 belief1_false_band_5_sce2 ... belief1_false_band_5_sce9{txt}->{res}belief1_false_band_5_sce
belief1_up_sce1 belief1_up_sce2 ... belief1_up_sce9{txt}->{res}belief1_up_sce
belief1_down_sce1 belief1_down_sce2 ... belief1_down_sce9{txt}->{res}belief1_down_sce
{txt}{hline 77}

{com}. 
. rename prior_sce prior
{res}{txt}
{com}. rename belief1_sce belief1
{res}{txt}
{com}. rename belief2_sce belief2
{res}{txt}
{com}. rename belief1_false_sce belief1_false
{res}{txt}
{com}. rename belief1_time_sce belief1_time_sec
{res}{txt}
{com}. rename belief2_time_sce belief2_time_sec
{res}{txt}
{com}. rename n_red_urn_sce n_red_urn
{res}{txt}
{com}. rename n_red_ball_rurn_sce n_red_ball_rurn
{res}{txt}
{com}. rename urn_sce urn
{res}{txt}
{com}. rename ball1_sce ball1
{res}{txt}
{com}. rename belief1_dist_sce belief1_dist
{res}{txt}
{com}. rename belief1_false_band_5_sce belief1_false_band_5
{res}{txt}
{com}. rename belief1_up_sce belief1_up
{res}{txt}
{com}. rename belief1_down_sce belief1_down
{res}{txt}
{com}. 
. rename belief2_false_sce belief2_false
{res}{txt}
{com}. rename belief2_false_band_5_sce belief2_false_band_5
{res}{txt}
{com}. rename belief2_dist_sce  belief2_dist
{res}{txt}
{com}. rename belief2_bayes_sce belief2_bayes
{res}{txt}
{com}. rename belief2_up_sce belief2_up
{res}{txt}
{com}. rename belief2_down_sce belief2_down
{res}{txt}
{com}. 
. rename bayes_revision_sce bayes_revision
{res}{txt}
{com}. rename actual_revision_sce actual_revision
{res}{txt}
{com}. 
. rename belief2_true_sce belief2_true
{res}{txt}
{com}. rename update_dir_correct_sce update_dir_correct
{res}{txt}
{com}. 
. label var scenario "Scenario number"
{txt}
{com}. label var prior "Objective prior"
{txt}
{com}. label var belief1 "Reported prior"
{txt}
{com}. label var belief2 "Reported update"
{txt}
{com}. 
. label var belief1_time_sec "Time in seconds for prior report"
{txt}
{com}. label var belief2_time_sec "Time in seconds for update report"
{txt}
{com}. 
. gen belief1_time_min = belief1_time_sec/60
{txt}
{com}. label var belief1_time_min "Time in minutes for prior report"
{txt}
{com}. 
. gen belief2_time_min = belief2_time_sec/60
{txt}
{com}. label var belief2_time_min "Time in minutes for update report"
{txt}
{com}. 
. label var belief1_false "Misreported prior"
{txt}
{com}. label var n_false_lower50 "# of misreports for prior < 50%"
{txt}
{com}. label var n_false_higher50 "# of misreports for prior > 50%"
{txt}
{com}. 
. label var belief1_up "Misreporting up prior"
{txt}
{com}. label var belief1_down "Misreporting down prior"
{txt}
{com}. 
. label var urn "Selected urn"
{txt}
{com}. label var ball1 "1st selected ball"
{txt}
{com}. 
. label data "Full sample with analysis variables in long format"
{txt}
{com}. 
. 
. 
. gen belief1_dist_abs = abs(belief1_dist)
{txt}
{com}. gen belief2_dist_abs = abs(belief2_dist)
{txt}
{com}. 
. 
. 
. // Generate consecutive numbers that corresponds to sorted priors:
. generate catvar = .
{txt}(891 missing values generated)

{com}. 
. local val = 0
{txt}
{com}. levelsof prior, local(levelsofvar)
{txt}10 20 30 40 50 60 70 80 90

{com}. foreach p of local levelsofvar {c -(}
{txt}  2{com}.     local val = `val'+1
{txt}  3{com}.     replace catvar = `val' +  0 if prior == `p'
{txt}  4{com}. {c )-}
{txt}(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)
(99 real changes made)

{com}. 
. 
. 
. save $datadir/clean/bdm_full_sample_long.dta, replace
{txt}file C:\Users\sunch\Dropbox\Davis\Research_Projects\bdm_incentives\data/clean/bdm_full_sample_long.dta saved

{com}. 
. 
. 
. local date2 = c(current_date)
{txt}
{com}. local time2 = c(current_time)
{txt}
{com}. 
. di "Do file clean_qualtrics_data.do start date time: `date1' `time1'"
{res}Do file clean_qualtrics_data.do start date time: 11 Nov 2022 12:58:57
{txt}
{com}. di "End date time: `date2' `time2'"
{res}End date time: 11 Nov 2022 12:58:58
{txt}
{com}. 
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\sunch\Dropbox\github_repos\bdm_bic\analysis/log/clean_qualtrics_data.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Nov 2022, 12:58:58
{txt}{.-}
{smcl}
{txt}{sf}{ul off}