{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\sunch\Dropbox\github_repos\bdm_bic\analysis/log/prelim_figures.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Nov 2022, 12:59:00
{txt}
{com}. 
. graph drop _all
{txt}
{com}. set more off
{txt}
{com}. set varabbrev off
{txt}
{com}. set graphics off
{txt}
{com}. set scheme s1color
{txt}
{com}. set seed 1984
{txt}
{com}. 
. local date1 = c(current_date)
{txt}
{com}. local time1 = c(current_time)
{txt}
{com}. 
. 
. // load data
. use $datadir/clean/bdm_full_sample_long, clear
{txt}(Full sample with analysis variables in long format)

{com}. 
. tempfile full_sample
{txt}
{com}. save `full_sample'
{txt}file C:\Users\sunch\AppData\Local\Temp\ST_00000001.tmp saved

{com}. 
. 
. //------------------------------------------------------------------------
. // scatter plot of percentage of false reports by scenario
. //------------------------------------------------------------------------
. 
. collapse (mean) pct_false1=belief1_false pct_false1_band_5=belief1_false_band_5 ///
>   bdm_check_pass_all = bdm_check_pass_all ///
>   (sd) sd_false1 = belief1_false sd_false1_band_5 = belief1_false_band_5 ///
>   (count) n = belief1_false, by(full_info scenario)
{txt}
{com}. 
. // high and low bounds for 95% confidence interval
. gen hi_95ci = pct_false1 + invttail(n-1,0.025)*(sd_false1 / sqrt(n))
{txt}
{com}. gen lo_95ci = pct_false1 - invttail(n-1,0.025)*(sd_false1 / sqrt(n))
{txt}
{com}. 
. gen hi_95ci_band_5 = pct_false1_band_5 + invttail(n-1,0.025)*(sd_false1_band_5 / sqrt(n))
{txt}
{com}. gen lo_95ci_band_5 = pct_false1_band_5 - invttail(n-1,0.025)*(sd_false1_band_5 / sqrt(n))
{txt}
{com}. 
. // strict definition of false report
. #delimit ;
{txt}delimiter now ;
{com}. graph twoway
>   (scatter pct_false1 scenario if full_info==1, connect(direct) msymbol(T)
>   msize(small)  lpattern(solid) color(midblue))
>   (rcap hi_95ci lo_95ci scenario if full_info==1,
>   lcolor(midblue) msize(small) lwidth(vthin))
>   (scatter pct_false1 scenario if full_info==0, connect(direct)
>   msize(small)  lpattern(solid) color(black))
>   (rcap hi_95ci lo_95ci scenario if full_info==0,
>   lcolor(black) msize(small) lwidth(vthin))
>   , aspectratio(1)  ysize(6)  xsize(6)
>   ytitle("Fraction of false reports", margin(zero) size(medlarge))
>   xtitle("Scenario", margin(small) size(medlarge))
>   ymtick(0(.01)1, tlwidth(vthin))
>   ytick(0(.05)1, tlwidth(vthin))
>   ylabel(0(0.1)1)
>   xlabel(1(1)9)
>   legend(order(1 3) label(1 "Full Info") label(3 "No Info"))
>   graphregion(color(white) margin(zero))
>   plotregion(margin(medsmall))
>   ;
{res}{txt}
{com}. #delimit cr
{txt}delimiter now cr
{com}. 
. graph export $projdir/out/fig/false_by_period.pdf, replace as(pdf)
{txt}(file C:\Users\sunch\Dropbox\github_repos\bdm_bic\analysis/out/fig/false_by_period.pdf written in PDF format)

{com}. graph export "$overleafdir/figures/false_by_period.pdf", replace as(pdf)
{err}unable to save PDF file
{txt}{search r(691):r(691);}

end of do-file
{search r(691):r(691);}

end of do-file

{search r(691):r(691);}

{com}.  do ./do/share/reg_tables.do
{txt}
{com}. ********************************************************************************
. /*regression tables  */
. ********************************************************************************
. ************************ Written by Christina Sun 10/30/2022 *******************
. 
. 
. /* Change Log: */
. 
. 
. 
.  /* to run this do file:
>  do ./do/share/reg_tables.do
>  */
. 
. cap log close _all
{smcl}
{com}{sf}{ul off}